# На всеки четен етаж има само офиси;
# oВсеки офис се означава по следния начин : О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0;

# На всеки нечетен етаж има само апартаменти;
# oВсеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0;

# На последният етаж винаги има апартаменти и те са по-големи от останалите, затова пред номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!

floors = int(input())
rooms = int(input())

for f in range(floors, 0, -1):
    for r in range(0, rooms):
        if f == floors:
            print(f'L{f}{r}', end=' ')
        elif f % 2 == 0:
            print(f'O{f}{r}', end=' ')
        elif f % 2 != 0:
            print(f'A{f}{r}', end=' ')
    print()


