# Входът се чете от конзолата и съдържа точно 3 реда:
# Ред 1.Малка буква от английската азбука за начало на интервала – от ‘a’ до ‚z’.
# Ред 2.Малка буква от английската азбука за край на интервала  – от първата буква до ‚z’.
# Ред 3.Малка буква от английската азбука – от ‘a’ до ‚z’ – като комбинациите съдържащи тази буквата се пропускат.

s1 = input()
s2 = input()
s3 = input()
counter = 0

for x in range(ord(s1), ord(s2) + 1):
    for y in range(ord(s1), ord(s2) + 1):
        for z in range(ord(s1), ord(s2) + 1):
            l1 = chr(x)
            l2 = chr(y)
            l3 = chr(z)
            if l3 != s3 and l1 != s3 and l2 != s3:
                print(f'{l1}{l2}{l3}', end=' ')
                counter += 1

print(counter)
